IDEA Open Model
Element1D.Segment Property
Compatible with IDEA StatiCa 20.1
 Line segment with start point and end point
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public ReferenceElement Segment { get; set; }
Public Property Segment As ReferenceElement
	Get
	Set
Property Value
Type: ReferenceElement
See Also
Reference
Element1D Class
IdeaRS.OpenModel.Model Namespace